# 테스트 케이스 수 입력
T = int(input())

# 테스트 케이스를 1번부터 T번까지 반복한다.
for tc in range(1, T + 1):

    # 숫자의 개수 N을 입력받는다.
    N = int(input())

    # 숫자를 입력받아 리스트 AN에 저장한다.
    AN = list(map(int, input().split()))

    # 조건을 만족한다고 가정하고 1로 시작한다.
    num = 1

    # 현재 숫자와 바로 다음 숫자를 비교해야 하므로 N-1까지 반복
    for i in range(N - 1):
        # 다음 숫자가 현재 숫자보다 작으면
        if AN[i + 1] < AN[i]:
            # 계속 감소하고 있는 상태이므로 1로 유지
            num = 1
        # 다음 숫자가 현재 숫자보다 크거나 같으면
        else:
            # 감소하는 상태가 아니므로 0으로 값 변경
            num = 0
            # 이미 조건이 맞지 않으므로 break
            break

    # 테스트 케이스 번호와 결과를 출력한다.
    print(f"#{tc} {num}")